#!/usr/bin/python3

# Упражнение 4 
# Задание 2

# Вывести на экран таблицу умножения на 3.
for i in range (1,10):
    print('3 * {:d} = {:d}'.format(i, 3 * i))
